IDEA Open Model
ConnectionInfo Class
Compatible with IDEA StatiCa 20.1
 Provides information about connection
Inheritance Hierarchy
System.Object
 IdeaRS.OpenModel.Connection.ConnectionInfo
 Namespace: IdeaRS.OpenModel.Connection
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 20.1.0
Syntax
public class ConnectionInfo
Public Class ConnectionInfo
The ConnectionInfo type exposes the following members.
Constructors
Name | Description
ConnectionInfo
Initializes a new instance of the ConnectionInfo class
Top
Properties
Name | Description
Description
 The description of the connection
Id
 The id of the connection
Identifier
 The identifier of the connection
Name
 The name of the connection
Top
See Also
Reference
IdeaRS.OpenModel.Connection Namespace